3A/SE465/Blackbox-Testing.org
#+title: Blackbox Testing
#+author: Arnav Gupta

* Blackbox Testing
Testing without having insight into code, based on a system's specification rather
than structure. Can have notion of coverage applied.

Rigorous specifications help functional testing, test case generation, and test
oracles.

Advantages:
- no need for source code
- wide applicability

Disadvantages:
- does not test hidden functions

** Error Guessing
Ad-hoc approach based on experience, developing and maintaning own error models.

Approach:
1. Make list of possible errors or error-prone situations
2. Yields an error model
3. Design test cases to cover error model

** Test Case Derivation from Functional Requirements
Involves clarification and restatement of the requirements such that requirements
are testable. Requires point form formulation that enumerates single requirements
and groups related requirements.

For each requirement, provide
- one test case showing requirement functioning
- one test case trying to falsify something
- test boundaries and constraints when possible

** Test Case Derivation from Use Cases
For each use case:
1. develop a scenario graph
2. determine all possible scenarios
3. analyze and rank scenarios
4. generate test cases from scenarios to meet coverage goal
5. execute test cases

Scenario graphs are generated from a use case:
- a node corresponds to a point where we wait for the next event to occur
- one starting node, end of use case is finish node
- edge corresponds to event occurrence
- full scenario is a path from start to finish

If too many scenarios, rank based on criticality and frequency, always
including main scenario, then generate test cases.

* Equivalence Partitioning
Motivation: want a sense of complete functional testing and hope to avoid
redundancy

*Equivalence classes (ECs)*: a partition of the input set according to
specification
- entire set is covered: completeness
- disjoint classes: avoid redundancy

ECs must be chosen wisely using heuristics.

*Weak equivalence class testing (WECT)*:
choose one variable value from each equivalence class

*Strong equivalence class testing (SECT)*:
based on Cartesian product of partition subsets

If error conditions are a high priority, should extend SECT to include
both valid and invalid inputs.
Equivalence partitioning is appropriate when input data is defined in
terms of range and sets of discrete values.
SECT makes the assumption that the variables are independent.
Heuristics are required in the case of too many test cases.

Advantages of Equivalence Partitioning:
- small number of test cases needed
- probability of uncovering defects with the selected test cases higher than that
  with a randomly chosen test suite of the same size

Limitations of Equivalence Partitioning:
- strongly typed languages eliminate need for consideration of some invalid inputs
- specification does not always define expected output for invalid test cases
- test selection approach does not work well when input variables are not
  independent
- brute force definition of test case for every combo of input ECs is impractical

