3A/SE465/Blackbox-Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-21 Wed 14:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blackbox Testing</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Blackbox Testing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0d3a17d">1. Blackbox Testing</a>
<ul>
<li><a href="#org6223c83">1.1. Error Guessing</a></li>
<li><a href="#orgfb04b99">1.2. Test Case Derivation from Functional Requirements</a></li>
<li><a href="#orgc63ec30">1.3. Test Case Derivation from Use Cases</a></li>
</ul>
</li>
<li><a href="#org6b2bc7c">2. Equivalence Partitioning</a>
<ul>
<li><a href="#orgc4a32ef">2.1. Heuristics for Identifying EC</a></li>
<li><a href="#org7dd27d8">2.2. Test Selection Approach</a></li>
</ul>
</li>
<li><a href="#orgef6a25a">3. Boundary Value Analysis</a>
<ul>
<li><a href="#org7aed0d6">3.1. Guidelines</a></li>
<li><a href="#org09b6cdf">3.2. Limitations</a></li>
<li><a href="#org1525107">3.3. Worst Case Testing</a></li>
</ul>
</li>
<li><a href="#org77082f3">4. Category Partitioning</a>
<ul>
<li><a href="#org23d4373">4.1. Criteria for Using Chocies</a></li>
</ul>
</li>
<li><a href="#orgc866068">5. Decision Tables</a>
<ul>
<li><a href="#org9e10219">5.1. Terminology</a>
<ul>
<li><a href="#org8d28b26">5.1.1. Don&rsquo;t Care</a></li>
</ul>
</li>
<li><a href="#org44dad83">5.2. Software Testing</a></li>
<li><a href="#org8d2ae2d">5.3. Applicability</a></li>
<li><a href="#org37cabc0">5.4. Issues</a></li>
<li><a href="#org7f35124">5.5. Guidelines and Observations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0d3a17d" class="outline-2">
<h2 id="org0d3a17d"><span class="section-number-2">1.</span> Blackbox Testing</h2>
<div class="outline-text-2" id="text-1">
<p>
Testing without having insight into code, based on a system&rsquo;s specification rather
than structure. Can have notion of coverage applied.
</p>

<p>
Rigorous specifications help functional testing, test case generation, and test
oracles.
</p>

<p>
Advantages:
</p>
<ul class="org-ul">
<li>no need for source code</li>
<li>wide applicability</li>
</ul>

<p>
Disadvantages:
</p>
<ul class="org-ul">
<li>does not test hidden functions</li>
</ul>
</div>
<div id="outline-container-org6223c83" class="outline-3">
<h3 id="org6223c83"><span class="section-number-3">1.1.</span> Error Guessing</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ad-hoc approach based on experience, developing and maintaning own error models.
</p>

<p>
Approach:
</p>
<ol class="org-ol">
<li>Make list of possible errors or error-prone situations</li>
<li>Yields an error model</li>
<li>Design test cases to cover error model</li>
</ol>
</div>
</div>
<div id="outline-container-orgfb04b99" class="outline-3">
<h3 id="orgfb04b99"><span class="section-number-3">1.2.</span> Test Case Derivation from Functional Requirements</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Involves clarification and restatement of the requirements such that requirements
are testable. Requires point form formulation that enumerates single requirements
and groups related requirements.
</p>

<p>
For each requirement, provide
</p>
<ul class="org-ul">
<li>one test case showing requirement functioning</li>
<li>one test case trying to falsify something</li>
<li>test boundaries and constraints when possible</li>
</ul>
</div>
</div>
<div id="outline-container-orgc63ec30" class="outline-3">
<h3 id="orgc63ec30"><span class="section-number-3">1.3.</span> Test Case Derivation from Use Cases</h3>
<div class="outline-text-3" id="text-1-3">
<p>
For each use case:
</p>
<ol class="org-ol">
<li>develop a scenario graph</li>
<li>determine all possible scenarios</li>
<li>analyze and rank scenarios</li>
<li>generate test cases from scenarios to meet coverage goal</li>
<li>execute test cases</li>
</ol>

<p>
Scenario graphs are generated from a use case:
</p>
<ul class="org-ul">
<li>a node corresponds to a point where we wait for the next event to occur</li>
<li>one starting node, end of use case is finish node</li>
<li>edge corresponds to event occurrence</li>
<li>full scenario is a path from start to finish</li>
</ul>

<p>
If too many scenarios, rank based on criticality and frequency, always
including main scenario, then generate test cases.
</p>
</div>
</div>
</div>
<div id="outline-container-org6b2bc7c" class="outline-2">
<h2 id="org6b2bc7c"><span class="section-number-2">2.</span> Equivalence Partitioning</h2>
<div class="outline-text-2" id="text-2">
<p>
Motivation: want a sense of complete functional testing and hope to avoid
redundancy
</p>

<p>
<b>Equivalence classes (ECs)</b>: a partition of the input set according to
specification
</p>
<ul class="org-ul">
<li>entire set is covered: completeness</li>
<li>disjoint classes: avoid redundancy</li>
</ul>

<p>
ECs must be chosen wisely using heuristics.
</p>

<p>
<b>Weak equivalence class testing (WECT)</b>:
choose one variable value from each equivalence class
</p>

<p>
<b>Strong equivalence class testing (SECT)</b>:
based on Cartesian product of partition subsets
</p>

<p>
If error conditions are a high priority, should extend SECT to include
both valid and invalid inputs.
Equivalence partitioning is appropriate when input data is defined in
terms of range and sets of discrete values.
SECT makes the assumption that the variables are independent.
Heuristics are required in the case of too many test cases.
</p>

<p>
Advantages of Equivalence Partitioning:
</p>
<ul class="org-ul">
<li>small number of test cases needed</li>
<li>probability of uncovering defects with the selected test cases higher than that
with a randomly chosen test suite of the same size</li>
</ul>

<p>
Limitations of Equivalence Partitioning:
</p>
<ul class="org-ul">
<li>strongly typed languages eliminate need for consideration of some invalid inputs</li>
<li>specification does not always define expected output for invalid test cases</li>
<li>test selection approach does not work well when input variables are not
independent</li>
<li>brute force definition of test case for every combo of input ECs is impractical</li>
</ul>
</div>
