3A/SE465/Blackbox-Testing.tex
% Created 2024-04-05 Fri 11:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip, darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Blackbox Testing}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Blackbox Testing},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Blackbox Testing}
\label{sec:org90884de}
Testing without having insight into code, based on a system's specification rather
than structure. Can have notion of coverage applied.

Rigorous specifications help functional testing, test case generation, and test
oracles.

Advantages:
\begin{itemize}
\item no need for source code
\item wide applicability
\end{itemize}

Disadvantages:
\begin{itemize}
\item does not test hidden functions
\end{itemize}
\subsection{Error Guessing}
\label{sec:orgd3cb772}
Ad-hoc approach based on experience, developing and maintaning own error models.

Approach:
\begin{enumerate}
\item Make list of possible errors or error-prone situations
\item Yields an error model
\item Design test cases to cover error model
\end{enumerate}
\subsection{Test Case Derivation from Functional Requirements}
\label{sec:orgbed97da}
Involves clarification and restatement of the requirements such that requirements
are testable. Requires point form formulation that enumerates single requirements
and groups related requirements.

For each requirement, provide
\begin{itemize}
\item one test case showing requirement functioning
\item one test case trying to falsify something
\item test boundaries and constraints when possible
\end{itemize}
\subsection{Test Case Derivation from Use Cases}
\label{sec:orge893991}
For each use case:
\begin{enumerate}
\item develop a scenario graph
\item determine all possible scenarios
\item analyze and rank scenarios
\item generate test cases from scenarios to meet coverage goal
\item execute test cases
\end{enumerate}

Scenario graphs are generated from a use case:
\begin{itemize}
\item a node corresponds to a point where we wait for the next event to occur
\item one starting node, end of use case is finish node
\item edge corresponds to event occurrence
\item full scenario is a path from start to finish
\end{itemize}

If too many scenarios, rank based on criticality and frequency, always
including main scenario, then generate test cases.
\section{Equivalence Partitioning}
\label{sec:orgec99514}
Motivation: want a sense of complete functional testing and hope to avoid
redundancy

\textbf{Equivalence classes (ECs)}: a partition of the input set according to
specification
\begin{itemize}
\item entire set is covered: completeness
\item disjoint classes: avoid redundancy
\end{itemize}

ECs must be chosen wisely using heuristics.

\textbf{Weak equivalence class testing (WECT)}:
choose one variable value from each equivalence class

\textbf{Strong equivalence class testing (SECT)}:
based on Cartesian product of partition subsets

If error conditions are a high priority, should extend SECT to include
both valid and invalid inputs.
Equivalence partitioning is appropriate when input data is defined in
terms of range and sets of discrete values.
SECT makes the assumption that the variables are independent.
Heuristics are required in the case of too many test cases.

Advantages of Equivalence Partitioning:
\begin{itemize}
\item small number of test cases needed
\item probability of uncovering defects with the selected test cases higher than that
with a randomly chosen test suite of the same size
\end{itemize}

Limitations of Equivalence Partitioning:
\begin{itemize}
\item strongly typed languages eliminate need for consideration of some invalid inputs
\item specification does not always define expected output for invalid test cases
\item test selection approach does not work well when input variables are not
independent
\item brute force definition of test case for every combo of input ECs is impractical
\end{itemize}
