3A/SE465/Blackbox-Testing.org
** Heuristics for Identifying EC
For each external input:
1. if input is a range of valid values, define:
   - one valid EC (within the range)
   - two invalid EC (one outside each end of the range)
2. if input is a number $N$ of valid values, define
   - one valid EC
   - two invalid EC (none and more than $N$)
3. if input is an element from a set of valid values, define:
   - one valid EC (within set)
   - one invalid EC (outside set)
4. if input is a must be situation (condition), define:
   - one valid EC (satisfies condition)
   - one invalid EC (does not satisfy condition)
5. if there is a reason to believe that elements in an EC are not
   handled in an identical manner by the program:
   - subdivide EC into smaller ECs
6. consider creating equivalence partitions that handle the
   default, empty, blank, null, zero, or none conditions

** Test Selection Approach
1. until all valid ECs have been covered by test cases,
   write a new test case that covers as many of the uncovered
   valid ECs as possible
2. until all invalid ECs have been covered by test cases,
   write a test case that covers only one of the uncovered invalid ECs
   (allows tester to observer response to single invalid input)

* Boundary Value Analysis
Some typical programming errors tend to occur near extreme values,
focus of boundary value testing.
Simpler but complementary to previous techniques.

*Data types with boundary conditions*: numeric, character, position,
quantity, speed, location, size, etc.

** Guidelines
Use input variable values (within a class) at min, just above min,
a nominal value, just below max, and at max.

Hold all other values at nominal values and include each boundary condition
in at least one valid test case.

** Limitations
Test cases are 4 times the number of variables.
This works well with variables that represent bounded physical quantities, since
there is no consideration of the nature of the function and the meaning
of the variables.

For more robust testing, include value just beyond boundary in at least
one invalid test case.

** Worst Case Testing
For programs with more than one variable with an extreme value,
take the Cartesian product of the min, min+, nom, max-, and max.

Much more effort: $5^{n}$ test cases

* Category Partitioning
Systematic, spec-based methodology that uses an informal functional spec to
produce a formal test spec.

Integrated EC testing and boundary value analysis and adds refinements.

Consists of:
- identification of categories
- partitioning each category into choices
- creating test frames as selection of choices
- creating test cases

Steps
1. decompose the fucntional spec into functional units that can be independently
   tested
2. examine each functional unit
   a. identify params
   b. identify environmental conditions
3. find categories for each param and environmental condition (major property or
   characteristic)
4. subdivide categories further into choices in the same way as equivalence partitioning
   is applied
5. determine constraints among choices: how they interact and affect each other
6. create test frames
7. create test cases

** Criteria for Using Chocies
*All Combinations (AC)*: typically done when using category partitioning, one value
for every choice of every param must be used with one value of every possible
choice of every other category

Number of test cases for AC is sum of number of choices in all categories.

*Each Choice (EC)*: weaker criterion, one value from each choice for each category
must be used at least in one test case

Number of test cases for EC is maximum number of choices in a category.

*Base Choice (BC)*: a compromise
- a base choice is chosen for each category and a first base test is formed by using
  the base choice for each category
- subsequent tests chosen by holding all but one base choice constant and forming
  choice combos by covering all non-base choices of the selected category
- this procedure is repeatd for all categories

Number of test cases for BC is sum of the number of choices in all categories minus
the number of categories.

BC can be the simplest, smallest, first in some ordering, or the most likely to be used.

* Decision Tables
Precise and compact way to model complex logic, by associating conditions with actions
to perform.

