3A/SE465/Blackbox-Testing.html
<div id="outline-container-orgc4a32ef" class="outline-3">
<h3 id="orgc4a32ef"><span class="section-number-3">2.1.</span> Heuristics for Identifying EC</h3>
<div class="outline-text-3" id="text-2-1">
<p>
For each external input:
</p>
<ol class="org-ol">
<li>if input is a range of valid values, define:
<ul class="org-ul">
<li>one valid EC (within the range)</li>
<li>two invalid EC (one outside each end of the range)</li>
</ul></li>
<li>if input is a number \(N\) of valid values, define
<ul class="org-ul">
<li>one valid EC</li>
<li>two invalid EC (none and more than \(N\))</li>
</ul></li>
<li>if input is an element from a set of valid values, define:
<ul class="org-ul">
<li>one valid EC (within set)</li>
<li>one invalid EC (outside set)</li>
</ul></li>
<li>if input is a must be situation (condition), define:
<ul class="org-ul">
<li>one valid EC (satisfies condition)</li>
<li>one invalid EC (does not satisfy condition)</li>
</ul></li>
<li>if there is a reason to believe that elements in an EC are not
handled in an identical manner by the program:
<ul class="org-ul">
<li>subdivide EC into smaller ECs</li>
</ul></li>
<li>consider creating equivalence partitions that handle the
default, empty, blank, null, zero, or none conditions</li>
</ol>
</div>
</div>
<div id="outline-container-org7dd27d8" class="outline-3">
<h3 id="org7dd27d8"><span class="section-number-3">2.2.</span> Test Selection Approach</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>until all valid ECs have been covered by test cases,
write a new test case that covers as many of the uncovered
valid ECs as possible</li>
<li>until all invalid ECs have been covered by test cases,
write a test case that covers only one of the uncovered invalid ECs
(allows tester to observer response to single invalid input)</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgef6a25a" class="outline-2">
<h2 id="orgef6a25a"><span class="section-number-2">3.</span> Boundary Value Analysis</h2>
<div class="outline-text-2" id="text-3">
<p>
Some typical programming errors tend to occur near extreme values,
focus of boundary value testing.
Simpler but complementary to previous techniques.
</p>

<p>
<b>Data types with boundary conditions</b>: numeric, character, position,
quantity, speed, location, size, etc.
</p>
</div>
<div id="outline-container-org7aed0d6" class="outline-3">
<h3 id="org7aed0d6"><span class="section-number-3">3.1.</span> Guidelines</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Use input variable values (within a class) at min, just above min,
a nominal value, just below max, and at max.
</p>

<p>
Hold all other values at nominal values and include each boundary condition
in at least one valid test case.
</p>
</div>
</div>
<div id="outline-container-org09b6cdf" class="outline-3">
<h3 id="org09b6cdf"><span class="section-number-3">3.2.</span> Limitations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Test cases are 4 times the number of variables.
This works well with variables that represent bounded physical quantities, since
there is no consideration of the nature of the function and the meaning
of the variables.
</p>

<p>
For more robust testing, include value just beyond boundary in at least
one invalid test case.
</p>
</div>
</div>
<div id="outline-container-org1525107" class="outline-3">
<h3 id="org1525107"><span class="section-number-3">3.3.</span> Worst Case Testing</h3>
<div class="outline-text-3" id="text-3-3">
<p>
For programs with more than one variable with an extreme value,
take the Cartesian product of the min, min+, nom, max-, and max.
</p>

<p>
Much more effort: \(5^{n}\) test cases
</p>
</div>
</div>
</div>
<div id="outline-container-org77082f3" class="outline-2">
<h2 id="org77082f3"><span class="section-number-2">4.</span> Category Partitioning</h2>
<div class="outline-text-2" id="text-4">
<p>
Systematic, spec-based methodology that uses an informal functional spec to
produce a formal test spec.
</p>

<p>
Integrated EC testing and boundary value analysis and adds refinements.
</p>

<p>
Consists of:
</p>
<ul class="org-ul">
<li>identification of categories</li>
<li>partitioning each category into choices</li>
<li>creating test frames as selection of choices</li>
<li>creating test cases</li>
</ul>

<p>
Steps
</p>
<ol class="org-ol">
<li>decompose the fucntional spec into functional units that can be independently
tested</li>
<li>examine each functional unit
<ol class="org-ol">
<li>identify params</li>
<li>identify environmental conditions</li>
</ol></li>
<li>find categories for each param and environmental condition (major property or
characteristic)</li>
<li>subdivide categories further into choices in the same way as equivalence partitioning
is applied</li>
<li>determine constraints among choices: how they interact and affect each other</li>
<li>create test frames</li>
<li>create test cases</li>
</ol>
</div>
<div id="outline-container-org23d4373" class="outline-3">
<h3 id="org23d4373"><span class="section-number-3">4.1.</span> Criteria for Using Chocies</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>All Combinations (AC)</b>: typically done when using category partitioning, one value
for every choice of every param must be used with one value of every possible
choice of every other category
</p>

<p>
Number of test cases for AC is sum of number of choices in all categories.
</p>

<p>
<b>Each Choice (EC)</b>: weaker criterion, one value from each choice for each category
must be used at least in one test case
</p>

<p>
Number of test cases for EC is maximum number of choices in a category.
</p>

<p>
<b>Base Choice (BC)</b>: a compromise
</p>
<ul class="org-ul">
<li>a base choice is chosen for each category and a first base test is formed by using
the base choice for each category</li>
<li>subsequent tests chosen by holding all but one base choice constant and forming
choice combos by covering all non-base choices of the selected category</li>
<li>this procedure is repeatd for all categories</li>
</ul>

<p>
Number of test cases for BC is sum of the number of choices in all categories minus
the number of categories.
</p>

<p>
BC can be the simplest, smallest, first in some ordering, or the most likely to be used.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc866068" class="outline-2">
<h2 id="orgc866068"><span class="section-number-2">5.</span> Decision Tables</h2>
<div class="outline-text-2" id="text-5">
<p>
Precise and compact way to model complex logic, by associating conditions with actions
to perform.
</p>
</div>
