3A/SE465/Blackbox-Testing.tex
\subsection{Heuristics for Identifying EC}
\label{sec:org4c1929c}
For each external input:
\begin{enumerate}
\item if input is a range of valid values, define:
\begin{itemize}
\item one valid EC (within the range)
\item two invalid EC (one outside each end of the range)
\end{itemize}
\item if input is a number \(N\) of valid values, define
\begin{itemize}
\item one valid EC
\item two invalid EC (none and more than \(N\))
\end{itemize}
\item if input is an element from a set of valid values, define:
\begin{itemize}
\item one valid EC (within set)
\item one invalid EC (outside set)
\end{itemize}
\item if input is a must be situation (condition), define:
\begin{itemize}
\item one valid EC (satisfies condition)
\item one invalid EC (does not satisfy condition)
\end{itemize}
\item if there is a reason to believe that elements in an EC are not
handled in an identical manner by the program:
\begin{itemize}
\item subdivide EC into smaller ECs
\end{itemize}
\item consider creating equivalence partitions that handle the
default, empty, blank, null, zero, or none conditions
\end{enumerate}
\subsection{Test Selection Approach}
\label{sec:orgffa913a}
\begin{enumerate}
\item until all valid ECs have been covered by test cases,
write a new test case that covers as many of the uncovered
valid ECs as possible
\item until all invalid ECs have been covered by test cases,
write a test case that covers only one of the uncovered invalid ECs
(allows tester to observer response to single invalid input)
\end{enumerate}
\section{Boundary Value Analysis}
\label{sec:org6bfa044}
Some typical programming errors tend to occur near extreme values,
focus of boundary value testing.
Simpler but complementary to previous techniques.

\textbf{Data types with boundary conditions}: numeric, character, position,
quantity, speed, location, size, etc.
\subsection{Guidelines}
\label{sec:org9229884}
Use input variable values (within a class) at min, just above min,
a nominal value, just below max, and at max.

Hold all other values at nominal values and include each boundary condition
in at least one valid test case.
\subsection{Limitations}
\label{sec:org7821089}
Test cases are 4 times the number of variables.
This works well with variables that represent bounded physical quantities, since
there is no consideration of the nature of the function and the meaning
of the variables.

For more robust testing, include value just beyond boundary in at least
one invalid test case.
\subsection{Worst Case Testing}
\label{sec:orgd1fdb0c}
For programs with more than one variable with an extreme value,
take the Cartesian product of the min, min+, nom, max-, and max.

Much more effort: \(5^{n}\) test cases
\section{Category Partitioning}
\label{sec:org035e0fd}
Systematic, spec-based methodology that uses an informal functional spec to
produce a formal test spec.

Integrated EC testing and boundary value analysis and adds refinements.

Consists of:
\begin{itemize}
\item identification of categories
\item partitioning each category into choices
\item creating test frames as selection of choices
\item creating test cases
\end{itemize}

Steps
\begin{enumerate}
\item decompose the fucntional spec into functional units that can be independently
tested
\item examine each functional unit
\begin{enumerate}
\item identify params
\item identify environmental conditions
\end{enumerate}
\item find categories for each param and environmental condition (major property or
characteristic)
\item subdivide categories further into choices in the same way as equivalence partitioning
is applied
\item determine constraints among choices: how they interact and affect each other
\item create test frames
\item create test cases
\end{enumerate}
\subsection{Criteria for Using Chocies}
\label{sec:org8f4ae0b}
\textbf{All Combinations (AC)}: typically done when using category partitioning, one value
for every choice of every param must be used with one value of every possible
choice of every other category

Number of test cases for AC is sum of number of choices in all categories.

\textbf{Each Choice (EC)}: weaker criterion, one value from each choice for each category
must be used at least in one test case

Number of test cases for EC is maximum number of choices in a category.

\textbf{Base Choice (BC)}: a compromise
\begin{itemize}
\item a base choice is chosen for each category and a first base test is formed by using
the base choice for each category
\item subsequent tests chosen by holding all but one base choice constant and forming
choice combos by covering all non-base choices of the selected category
\item this procedure is repeatd for all categories
\end{itemize}

Number of test cases for BC is sum of the number of choices in all categories minus
the number of categories.

BC can be the simplest, smallest, first in some ordering, or the most likely to be used.
\section{Decision Tables}
\label{sec:org0b3782d}
Precise and compact way to model complex logic, by associating conditions with actions
to perform.
