3A/SE465/Blackbox-Testing.org
** Terminology
*Limited entry table*: condition entries restricted to binary values

*Extended entry table*: condition entries have more than 2 values

*** Don't Care
Reduces number of variants, not the same as unknown.

Corresponds to the cases where:
- inputs are necessary but have no effect
- inputs may be omitted
- mutually exclusive cases

When conditions are equivalent classes, inputs are mutually exclusive.

** Software Testing
Condition entries in a decision table are interpreted by a computer program as
input and equivalence class of inputs.

Action entries in a decision table are interpreted as output and major functional
processing portions.

Rules then become test cases.

Limited entry tables have exponential growth from conditions to rules, though this
can be reduced with don't cares.

Less rules than combination rule count indicates missing rules, and more rules
than combination count indicates either redundant rules or inconsistent table.

** Applicability
Given spec can be converted to a decision table:
- the order in which predicates or rules are evaluated does not affect rule
  interpretation or resulting actions
- once a rule is satisfied and the action is selected, no other rule needs to be
  exaned
- the order of executing actions in a satisfied rule does not matter

** Issues
Before deriving test cases, ensure:
- rules are complete, that every combo of predicate truth values is
  explicit in the decision table
- rules are consistent, that every combo of predicate truth values is only one
  action or set of actions

** Guidelines and Observations
Decision table is best for programs with:
- lots of decision making
- important logical relationships among input variables
- calculations involving subsets of input variables
- cause and effect between input and output
- complex computational logic

Decision tables do not scale well and must be iteratively refined.

Important to look for redundant, inconsistent, and missing rules.
