3A/SE465/Blackbox-Testing.html
<div id="outline-container-org9e10219" class="outline-3">
<h3 id="org9e10219"><span class="section-number-3">5.1.</span> Terminology</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>Limited entry table</b>: condition entries restricted to binary values
</p>

<p>
<b>Extended entry table</b>: condition entries have more than 2 values
</p>
</div>
<div id="outline-container-org8d28b26" class="outline-4">
<h4 id="org8d28b26"><span class="section-number-4">5.1.1.</span> Don&rsquo;t Care</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Reduces number of variants, not the same as unknown.
</p>

<p>
Corresponds to the cases where:
</p>
<ul class="org-ul">
<li>inputs are necessary but have no effect</li>
<li>inputs may be omitted</li>
<li>mutually exclusive cases</li>
</ul>

<p>
When conditions are equivalent classes, inputs are mutually exclusive.
</p>
</div>
</div>
</div>
<div id="outline-container-org44dad83" class="outline-3">
<h3 id="org44dad83"><span class="section-number-3">5.2.</span> Software Testing</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Condition entries in a decision table are interpreted by a computer program as
input and equivalence class of inputs.
</p>

<p>
Action entries in a decision table are interpreted as output and major functional
processing portions.
</p>

<p>
Rules then become test cases.
</p>

<p>
Limited entry tables have exponential growth from conditions to rules, though this
can be reduced with don&rsquo;t cares.
</p>

<p>
Less rules than combination rule count indicates missing rules, and more rules
than combination count indicates either redundant rules or inconsistent table.
</p>
</div>
</div>
<div id="outline-container-org8d2ae2d" class="outline-3">
<h3 id="org8d2ae2d"><span class="section-number-3">5.3.</span> Applicability</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Given spec can be converted to a decision table:
</p>
<ul class="org-ul">
<li>the order in which predicates or rules are evaluated does not affect rule
interpretation or resulting actions</li>
<li>once a rule is satisfied and the action is selected, no other rule needs to be
exaned</li>
<li>the order of executing actions in a satisfied rule does not matter</li>
</ul>
</div>
</div>
<div id="outline-container-org37cabc0" class="outline-3">
<h3 id="org37cabc0"><span class="section-number-3">5.4.</span> Issues</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Before deriving test cases, ensure:
</p>
<ul class="org-ul">
<li>rules are complete, that every combo of predicate truth values is
explicit in the decision table</li>
<li>rules are consistent, that every combo of predicate truth values is only one
action or set of actions</li>
</ul>
</div>
</div>
<div id="outline-container-org7f35124" class="outline-3">
<h3 id="org7f35124"><span class="section-number-3">5.5.</span> Guidelines and Observations</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Decision table is best for programs with:
</p>
<ul class="org-ul">
<li>lots of decision making</li>
<li>important logical relationships among input variables</li>
<li>calculations involving subsets of input variables</li>
<li>cause and effect between input and output</li>
<li>complex computational logic</li>
</ul>

<p>
Decision tables do not scale well and must be iteratively refined.
</p>

<p>
Important to look for redundant, inconsistent, and missing rules.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-21 Wed 14:37</p>
</div>
</body>
</html>
