3A/SE465/Blackbox-Testing.tex
\subsection{Terminology}
\label{sec:org1a83c8a}
\textbf{Limited entry table}: condition entries restricted to binary values

\textbf{Extended entry table}: condition entries have more than 2 values
\subsubsection{Don't Care}
\label{sec:org8a5103a}
Reduces number of variants, not the same as unknown.

Corresponds to the cases where:
\begin{itemize}
\item inputs are necessary but have no effect
\item inputs may be omitted
\item mutually exclusive cases
\end{itemize}

When conditions are equivalent classes, inputs are mutually exclusive.
\subsection{Software Testing}
\label{sec:org172ed9a}
Condition entries in a decision table are interpreted by a computer program as
input and equivalence class of inputs.

Action entries in a decision table are interpreted as output and major functional
processing portions.

Rules then become test cases.

Limited entry tables have exponential growth from conditions to rules, though this
can be reduced with don't cares.

Less rules than combination rule count indicates missing rules, and more rules
than combination count indicates either redundant rules or inconsistent table.
\subsection{Applicability}
\label{sec:org7c76fa4}
Given spec can be converted to a decision table:
\begin{itemize}
\item the order in which predicates or rules are evaluated does not affect rule
interpretation or resulting actions
\item once a rule is satisfied and the action is selected, no other rule needs to be
exaned
\item the order of executing actions in a satisfied rule does not matter
\end{itemize}
\subsection{Issues}
\label{sec:orgc7abb43}
Before deriving test cases, ensure:
\begin{itemize}
\item rules are complete, that every combo of predicate truth values is
explicit in the decision table
\item rules are consistent, that every combo of predicate truth values is only one
action or set of actions
\end{itemize}
\subsection{Guidelines and Observations}
\label{sec:org73c6c20}
Decision table is best for programs with:
\begin{itemize}
\item lots of decision making
\item important logical relationships among input variables
\item calculations involving subsets of input variables
\item cause and effect between input and output
\item complex computational logic
\end{itemize}

Decision tables do not scale well and must be iteratively refined.

Important to look for redundant, inconsistent, and missing rules.
\end{document}
